# **************************************************************************** #
#                                                                              #
#                                                         :::      ::::::::    #
#    bd_init.sh                                         :+:      :+:    :+:    #
#                                                     +:+ +:+         +:+      #
#    By: aberry <aberry>                            +#+  +:+       +#+         #
#                                                 +#+#+#+#+#+   +#+            #
#    Created: 2021/03/16 19:45:14 by aberry            #+#    #+#              #
#    Updated: 2021/03/16 19:49:01 by aberry           ###   ########.fr        #
#                                                                              #
# **************************************************************************** #

#!/bin/sh

# Alpine Linux использует OpenRC для своей системы инициализации.
# Сервис можно запустить с помощью команд
openrc default
/etc/init.d/mariadb setup
rc-service mariadb start
# Устанавливаем наши бд
mysql -u root mysql < main_bd.sql
# Завершаем инициализацию 
rc-service mariadb stop