# **************************************************************************** #
#                                                                              #
#                                                         :::      ::::::::    #
#    start_supervisord.sh                               :+:      :+:    :+:    #
#                                                     +:+ +:+         +:+      #
#    By: aberry <aberry>                            +#+  +:+       +#+         #
#                                                 +#+#+#+#+#+   +#+            #
#    Created: 2021/03/12 00:01:23 by aberry&lmit       #+#    #+#              #
#    Updated: 2021/03/19 17:51:59 by aberry           ###   ########.fr        #
#                                                                              #
# **************************************************************************** #

# Запускаем скрипт который проинициализирует наши бд
sh bd_init.sh

# Запускаем supervisord
supervisord -c /etc/supervisord.conf